class JobPoint:
    def __init__(self, provider: int, consumers: list, ):
        super().__init__()

    """
        stage1-作业条件:
        归属方(业务单位)(离散值)
        服务方(业务单位)(离散值集合)

        (顶级作业点)作业条件:
        消费物的所有权=作业点服务方;

        =>任意作业点作业条件(子目标_事务):
        消费物的起始所有权=作业点服务方
        消费物的目标所有权=任意/已知

        stage2-作业方式:
        △物的转化(物:[list(现实&概念=子物ID1)→list(现实&概念2),list(现实&概念3)→list(现实&概念4)])
        非优化转化(四权,品质:list(值1)→list(值2),list(值3)→list(值4))
        位移(位置:list(值1)→值2)
        组合(组合:list(值1)→值2)
        验合(数量,单位,物,四权,品质,位置,组合:未知→已知)

        f(a)=b,a*b
    """
